Repository: imCodePartnerAB/KOHASS12000
Catalog: Koha/Plugin/imCode/KohaSS12000/ExportUsers/*.po
Languages: fi, sv

source: Export Users from SS12000
fi: Käyttäjien vienti SS12000:sta
sv: Export av användare från SS12000

source: Configuration imCode SS12000
fi: Konfigurointi imCode SS12000
sv: Konfiguration imCode SS12000

source: Home
fi: Etusivu
sv: Hem

source: Plugins
fi: Liitännäiset
sv: Hantera plugins

source: KohaSS12000 &rsaquo; Tool
fi: KohaSS12000 &rsaquo; Työkalu
sv: KohaSS12000 &rsaquo; Verktyg

source: KohaSS12000 &rsaquo; Configuration
fi: KohaSS12000 &rsaquo; Konfigurointi
sv: KohaSS12000 &rsaquo; Konfiguration

source: Configuration Settings
fi: Konfigurointiasetukset
sv: Konfigurationsinställningar

source: Tool
fi: Työkalu
sv: Verktyg

source: Action
fi: Toiminta
sv: Åtgärder

source: Show user export log
fi: Näytä käyttäjän vientiloki
sv: Visa exportlogg för användare

source: Show user export statistics
fi: Näytä käyttäjän vientitilastot
sv: Visa statistik för användarexport

source: Ok
fi: Okei
sv: Okej

source: Logs Lines
fi: Lokit Linjat
sv: Loggar linjer

source: Page token Next
fi: Sivun merkki Seuraava
sv: Page token Nästa

source: Record Count
fi: Tietueiden määrä
sv: Antal inspelningar

source: Response
fi: Vastaus
sv: Svar

source: Data Status
fi: Tietojen tila
sv: Status för data

source: Created At
fi: Luonut
sv: Skapad vid

source: Is Processed
fi: Käsitellään
sv: Har bearbetats

source: Data Hash
sv: Hash för data

source: Last Statistics Lines
sv: Senaste statistiska linjer

source: Added
fi: Lisätty
sv: Tillagd

source: Updated
fi: Päivitetty
sv: Uppdaterad

source: Date
fi: Päivämäärä
sv: Datum

source: Yes
fi: Kyllä
sv: Ja

source: No
fi: Ei
sv: Nej

source: OAUTH API URL
fi: URL-osoite tunnisteiden hakua varten
sv: URL för åtkomsttoken för hämtning

source: Koha Default Categorycode
sv: Standard låntagarkategori

source: Select a category
fi: Valitse luokka
sv: Välj en kategori

source: When you change a parameter, it will be changed for all existing users in the next data update cycle
sv: När du ändrar en parameter kommer den att ändras för alla befintliga användare i nästa datauppdateringscykel

source: Koha Default Branchcode
sv: Standard bibliotek

source: Choose a branch
fi: Valitse haara
sv: Välj en bransch

source: Debug Mode
fi: Vianmääritystila
sv: Debuggläge

source: If this option is enabled, then there will be more data in the Tool tab and the Response from the API will be put into the database in full
fi: Jos tämä vaihtoehto on käytössä, Työkalu-välilehdellä on enemmän tietoja ja API:n vastaus tallennetaan tietokantaan kokonaisuudessaan
sv: Om detta alternativ är aktiverat kommer det att finnas mer data på fliken Verktyg och svaret från API:et kommer att läggas in i databasen i sin helhet

source: SS12000 API limit per page
fi: SS12000 API-raja sivua kohti
sv: SS12000 API gräns per sida

source: 10 or 20 - fast, 30 - normal, 100 - very slowly
fi: 10 tai 20 - nopeasti, 30 - normaalisti, 100 - hyvin hitaasti
sv: 10 eller 20 - snabbt, 30 - normalt, 100 - mycket långsamt

source: CardNumber for Koha
sv: Kortnummer för Koha

source: CivicNo is used by default
fi: CivicNo on oletusarvoisesti käytössä
sv: CivicNo används som standard

source: UserID for Koha
sv: Användar-ID för Koha

source: How many days to keep plugin logs
fi: Kuinka monta päivää pitää säilyttää plugin-lokit
sv: Hur många dagar ska plugin-loggar sparas

source: The default value is 3 days
fi: Oletusarvo on 3 päivää
sv: Standardvärdet är 3 dagar

source: Save
fi: Tallenna
sv: Spar

source: Please select values for both Koha Default Categorycode and Koha Default Branchcode
fi: Valitse arvot sekä Koha Default Categorycode että Koha Default Branchcode -koodeille
sv: Välj värden för både Standard låntagarkategori och Standard bibliotek

source: This plugin implements export users from SS12000
fi: Tämä lisäosa toteuttaa käyttäjien viennin SS12000:sta
sv: Detta plugin implementerar exportanvändare från SS12000

source: Configuration successfully updated
fi: Konfiguraatio päivitetty onnistuneesti
sv: Konfigurationen har uppdaterats framgångsrikt

source: An error was detected
fi: Virhe havaittiin
sv: Ett fel har upptäckts

source: KohaSS12000 &rsaquo; Error
fi: KohaSS12000 &rsaquo; Virhe
sv: KohaSS12000 &rsaquo; Fel

source: Missing required module
fi: Puuttuva vaadittu moduuli
sv: Saknar obligatorisk modul

source: Run in the server command line
fi: Suorita palvelimen komentorivillä
sv: Kör i serverns kommandorad

source: Text copied to clipboard
fi: Leikepöydälle kopioitu teksti
sv: Text kopierad till urklipp

source: Show users data update
fi: Näytä käyttäjien tietojen päivitys
sv: Visa användardatauppdatering

source: Branches mapping and/or Categories mapping not configured correctly
sv: Grenmappning och/eller kategorimappning är inte korrekt konfigurerad

source: WARNING
sv: VARNING

source: Categories mapping
sv: Mappning av låntagarkategorier

source: click here to mark this object for deletion
sv: klicka här för att markera detta objekt för radering

source: Add category mapping
sv: Lägg till mappning

source: If need be added, enter existing dutyRole here
sv: Om det behövs, skriv in befintlig dutyRole här

source: Branches mapping
sv: Mappning av biblioteksenhet

source: Add branch mapping
sv: Lägg till mappning

source: If need be added, enter existing organisationCode here
sv: Om det behövs, skriv in befintlig organisationskod här

source: Updates Lines
sv: Uppdaterar linjer

source: Search
sv: Sök

source: Nothing was found for your request
sv: Inget hittades för din begäran

source: User
sv: Användare

source: Change Description
sv: Ändra beskrivning

source: Change Timestamp
sv: Ändra tidsstämpel

source: Previous page
sv: Föregående sida

source: Next page
sv: Nästa sida

source: Last
sv: Sista

source: page
sv: sidan

source: To delete an item from the list, select the checkbox of the item to be deleted, and press Save
sv: Om du vill ta bort ett objekt från listan markerar du kryssrutan för objektet som ska tas bort och trycker på Spara

source: Click to mark for deletion
sv: Klicka för att markera för radering

source: Click to mark do not import
sv: Klicka för att markera importera inte

source: Delete
sv: Radera

source: Do not import
sv: Importera inte

source: Exclude empty users, dutyRole
sv: Exkludera tomma användare, dutyRole

source: Excluding all users that does not have dutyRole
sv: Exkluderar alla användare som inte har dutyRole

source: Exclude empty users, enrolments
sv: Uteslut tomma användare, registreringar

source: Excluding all users that does not have enrolments
sv: Exkluderar alla användare som inte har registreringar

source: Delete users who have been marked as ARCHIVED?
sv: Ta bort användare som har markerats som ARKIVERADE?

source: Start exporting data from the API
sv: Börja exportera data från API:et

source: SS12000 Export Users Tool
sv: SS12000 Export Användarverktyg

source: This tool will export users data using SS12000 format
sv: Detta verktyg kommer att exportera användardata med SS12000-format

source: The process will run in the background and may take several minutes to complete
sv: Processen körs i bakgrunden och kan ta flera minuter att slutföra

source: Start Export
sv: Starta export

source: Force Unlock Process
sv: Force upplåsningsprocess

source: Are you sure you want to force unlock the process? Only do this if the process is stuck
sv: Är du säker på att du vill tvinga fram en upplåsning av processen? Gör detta endast om processen har fastnat

source: Set API scanner from the first page
sv: Ställ in API-scanner från första sidan

source: Last 10 Statistics Lines
fi: Viimeiset 10 tilastoriviä

source: If Update on UPDATE, then - When you change a parameter, it will be changed for all existing users in the next data update cycle
fi: Jos Update on UPDATE, niin - Kun muutat parametria, se muuttuu kaikkien nykyisten käyttäjien osalta seuraavassa tietojen päivityssyklissä

source: Update on INSERT or UPDATE
fi: Päivitys INSERT- tai UPDATE-toiminnolla

source: Update <b>Koha Default Categorycode</b> and <b>Koha Default Branchcode</b> always, or only when adding a user
fi: Päivitä <b>Koha Default Categorycode</b> ja <b>Koha Default Branchcode</b> aina tai vain käyttäjän lisäämisen yhteydessä
